const locationData = {
    กรุงเทพมหานคร: {
        districts: {
            "เขตพระนคร": [
                "พระบรมมหาราชวัง",
                "วังบูรพาภิรมย์",
                "วัดราชบพิธ",
                "สำราญราษฎร์",
                "ศาลเจ้าพ่อเสือ",
                "เสาชิงช้า",
                "บวรนิเวศ",
                "ตลาดยอด",
                "ชนะสงคราม",
                "บ้านพานถม",
                "บางขุนพรหม",
                "วัดสามพระยา",
            ],
            "เขตดุสิต": [
                "ดุสิต",
                "วชิรพยาบาล",
                "สวนจิตรลดา",
                "สี่แยกมหานาค",
                "บางซื่อ",
                "ถนนนครไชยศรี",
                "สามเสนใน",
            ],

            "เขตหนองจอก": [
                "กระทุ่มราย",
                "หนองจอก",
                "คลองสิบ",
                "คลองสิบสอง",
                "โคกแฝด",
                "คู้ฝั่งเหนือ",
                "ลำผักชี",
                "ลำต้อยติ่ง",
            ],
        },
    },
    "Samut Prakan": {
        districts: {
            "Mueang Samut Prakan": ["Pak Nam", "Bang Mueang"],
        },
    },
    Nonthaburi: {
        districts: {
            "Mueang Nonthaburi": ["Talat Khwan", "Suan Yai"],
        },
    },
    // Add other provinces similarly
};

export default locationData;
